Revit 2027 API
BuiltInFailures.WallJoinRoofFailures.WallMeetsRoofTangentially Property
 The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallMeetsRoofTangentially { get; }
Public Shared ReadOnly Property WallMeetsRoofTangentially As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
static member WallMeetsRoofTangentially : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace